FEATURE = ("色泽", "根蒂", "敲声", "纹理", "脐部", "触感")
WATERMELON = (
    ["青绿", "蜷缩", "浊响", "清晰", "凹陷", "硬滑"],  # 1  # 0 # 0 
    ["乌黑", "蜷缩", "沉闷", "清晰", "凹陷", "硬滑"],  # 2  # 1 # 1
    ["乌黑", "蜷缩", "浊响", "清晰", "凹陷", "硬滑"],  # 3  # 2 # 2
    ["青绿", "蜷缩", "沉闷", "清晰", "凹陷", "硬滑"],  # 4
    ["浅白", "蜷缩", "浊响", "清晰", "凹陷", "硬滑"],  # 5
    ["青绿", "稍蜷", "浊响", "清晰", "稍凹", "软粘"],  # 6  # 5 # 3
    ["乌黑", "稍蜷", "浊响", "稍糊", "稍凹", "软粘"],  # 7  # 6 # 4
    ["乌黑", "稍蜷", "浊响", "清晰", "稍凹", "硬滑"],  # 8  # 7 # 此行和上面的label为“是”
    ["乌黑", "稍蜷", "沉闷", "稍糊", "稍凹", "硬滑"],  # 9
    ["青绿", "硬挺", "清脆", "清晰", "平坦", "软粘"],  # 10 # 9 # 5
    ["浅白", "硬挺", "清脆", "模糊", "平坦", "硬滑"],  # 11
    ["浅白", "蜷缩", "浊响", "模糊", "平坦", "软粘"],  # 12
    ["青绿", "稍蜷", "浊响", "稍糊", "凹陷", "硬滑"],  # 13
    ["浅白", "稍蜷", "沉闷", "稍糊", "凹陷", "硬滑"],  # 14 # 13 # 6
    ["乌黑", "稍蜷", "浊响", "清晰", "稍凹", "软粘"],  # 15 # 14 # 7
    ["浅白", "蜷缩", "浊响", "模糊", "平坦", "硬滑"],  # 16 # 15 # 8
    ["青绿", "蜷缩", "沉闷", "稍糊", "稍凹", "硬滑"])  # 17 # 16 # 9
LABEL = ("是", "是", "是", "是", "是", "是", "是", "是",
         "否", "否", "否", "否", "否", "否", "否", "否", "否")

