FEATURE = ("色泽", "根蒂", "敲声", "纹理", "脐部", "触感")
WATERMELON = [
    ["青绿", "蜷缩", "浊响", "清晰", "凹陷", "硬滑"],  # 0
    ["乌黑", "蜷缩", "沉闷", "清晰", "凹陷", "硬滑"],  # 1
    ["乌黑", "蜷缩", "浊响", "清晰", "凹陷", "硬滑"],  # 2
    ["青绿", "蜷缩", "沉闷", "清晰", "凹陷", "硬滑"],
    ["浅白", "蜷缩", "浊响", "清晰", "凹陷", "硬滑"],
    ["青绿", "稍蜷", "浊响", "清晰", "稍凹", "软粘"],  # 5
    ["乌黑", "稍蜷", "浊响", "稍糊", "稍凹", "软粘"],  # 6
    ["乌黑", "稍蜷", "浊响", "清晰", "稍凹", "硬滑"],  # 上面是正例
    ["乌黑", "稍蜷", "沉闷", "稍糊", "稍凹", "硬滑"],
    ["青绿", "硬挺", "清脆", "清晰", "平坦", "软粘"],  # 9
    ["浅白", "硬挺", "清脆", "模糊", "平坦", "硬滑"],
    ["浅白", "蜷缩", "浊响", "模糊", "平坦", "软粘"],
    ["青绿", "稍蜷", "浊响", "稍糊", "凹陷", "硬滑"],
    ["浅白", "稍蜷", "沉闷", "稍糊", "凹陷", "硬滑"],  # 13
    ["乌黑", "稍蜷", "浊响", "清晰", "稍凹", "软粘"],  # 14
    ["浅白", "蜷缩", "浊响", "模糊", "平坦", "硬滑"],  # 15
    ["青绿", "蜷缩", "沉闷", "稍糊", "稍凹", "硬滑"]]  # 16
LABEL = ("是", "是", "是", "是", "是", "是", "是", "是",
         "否", "否", "否", "否", "否", "否", "否", "否", "否")